EDTДоговоры_ПРОФ_демо/src/Catalogs/ВидыДокументов/ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДокументов</name>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримерНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДоговорныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоГотовит</name>
    <type>
      <types>EnumRef.КтоГотовит</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаАвтозаполнения</name>
    <attributes>
      <name>ШаблонФайла</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоАвтозаполнения</name>
      <type>
        <types>CatalogRef.ПравилаАвтозаполненияФайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДляКого</name>
      <type>
        <types>EnumRef.ЮридическоеФизическоеЛицо</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDTДоговоры_ПРОФ_демо/src/Enums/ТипыДоговорныхДокументов/ТипыДоговорныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговорныхДокументов</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДопСоглашение</name>
  </enumValues>
  <enumValues>
    <name>Акт</name>
  </enumValues>
  <enumValues>
    <name>Накладная</name>
  </enumValues>
  <enumValues>
    <name>Счет</name>
  </enumValues>
</mdclass:Enum>

EDTДоговоры_ПРОФ_демо/src/Catalogs/ВидыДокументов/Forms/ФормаФорматаНомера/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Тип = Параметры.Тип;
	ФорматНомера = Параметры.ФорматНомера;
	ВидДокумента = Параметры.ВидДокумента;
	СледующийНомер = Параметры.СледующийНомер;
	
	Если Не ЗначениеЗаполнено(ФорматНомера) Тогда 
		ФорматНомера = НСтр("ru = '[Номер]'");
	КонецЕсли;
	
	ЭтоДоговор = (Тип = Перечисления.ТипыДоговорныхДокументов.Договор);
	Если ЭтоДоговор Тогда 
		Элементы.НомерДокументаОснования.Видимость = Ложь;
	КонецЕсли;	
	
	Если ЭтоДоговор Тогда 
		Элементы.СледующийНомер.Видимость = Истина;
		Если СледующийНомер > 1 Тогда 
			Элементы.СледующийНомер.Заголовок = НСтр("ru = 'Следующий'");
			Элементы.СледующийНомер.Подсказка = НСтр("ru = 'Следующий номер'");
		КонецЕсли;
	Иначе	
		Элементы.СледующийНомер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьПримерНомера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФорматНомераПриИзменении(Элемент)
	
	СформироватьПримерНомера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДеньМесяца(Команда)
	
	ФорматНомера = ФорматНомера + "[День]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерМесяца(Команда)
	
	ФорматНомера = ФорматНомера + "[Месяц]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКвартала(Команда)
	
	ФорматНомера = ФорматНомера + "[Квартал]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Год2(Команда)
	
	ФорматНомера = ФорматНомера + "[Год2]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Год4(Команда)
	
	ФорматНомера = ФорматНомера + "[Год4]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексОтветственного(Команда)
	
	ФорматНомера = ФорматНомера + "[ИндексОтв]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаОснования(Команда)
	
	ФорматНомера = ФорматНомера + "[НомерДокОсн]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Номер(Команда)
	
	ФорматНомера = ФорматНомера + "[Номер]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ФорматНомера", СокрЛП(ФорматНомера));
	ПараметрыЗакрытия.Вставить("ПримерНомера", СокрЛП(ПримерНомера));
	ПараметрыЗакрытия.Вставить("СледующийНомер", СледующийНомер);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьПримерНомера()
	
	ОписаниеОшибки = "";
	Если Не Нумерация.СформироватьПримерНомера(ФорматНомера, ПримерНомера, ОписаниеОшибки) Тогда 
		ПримерНомера = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка в формате номера: %1'"), ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
